// 中间界面数据
module.exports = {
  'GET /api/centerPageData': {
    detailsList: [
      {
        title: '激活用户总数',
        number: 31023898,
        unit: '人',
      },
      {
        title: '服务客户总数',
        number: 2399887,
        unit: '人',
      },
      {
        title: '安全服务流量',
        number: 24332,
        unit: '点击/功能',
      },
      {
        title: '技术专利总数',
        number: 34,
        unit: '个',
      },
      {
        title: '新增用户订单',
        number: 96,
        unit: '/月',
      },
      {
        title: '新增活跃用户',
        number: 6975,
        unit: '/月',
      },
    ],
    mapData: {
      moveLines: [
        {
          fromName: '黑龙江',
          toName: '珠海',
          coords: [
            [126.661669, 45.742347],
            [113.576726, 22.270715],
          ],
        },
        {
          fromName: '黑龙江',
          toName: '舒兰',
          coords: [
            [126.661669, 45.742347],
            [126.965607, 44.406106],
          ],
        },
        {
          fromName: '黑龙江',
          toName: '大连',
          coords: [
            [126.661669, 45.742347],
            [121.614682, 38.914003],
          ],
        },
        {
          fromName: '辽宁',
          toName: '集安',
          coords: [
            [123.42944, 41.835441],
            [126.194031, 41.125307],
          ],
        },
        {
          fromName: '吉林',
          toName: '抚顺',
          coords: [
            [126.549572, 43.837883],
            [123.957208, 41.880872],
          ],
        },
        {
          fromName: '山东',
          toName: '南京',
          coords: [
            [117.020359, 36.66853],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '北京',
          toName: '沈阳',
          coords: [
            [116.407526, 39.90403],
            [123.431475, 41.805698],
          ],
        },
        {
          fromName: '黑龙江',
          toName: '环翠',
          coords: [
            [126.661669, 45.742347],
            [122.123444, 37.501991],
          ],
        },
        {
          fromName: '天津',
          toName: '大连',
          coords: [
            [117.200983, 39.084158],
            [121.614682, 38.914003],
          ],
        },
        {
          fromName: '吉林',
          toName: '兴和',
          coords: [
            [126.549572, 43.837883],
            [113.834173, 40.872301],
          ],
        },
        {
          fromName: '河北',
          toName: '勃利',
          coords: [
            [114.475704, 38.584854],
            [130.592171, 45.755063],
          ],
        },
        {
          fromName: '吉林',
          toName: '大连',
          coords: [
            [126.549572, 43.837883],
            [121.614682, 38.914003],
          ],
        },
        {
          fromName: '吉林',
          toName: '沈阳',
          coords: [
            [126.549572, 43.837883],
            [123.431475, 41.805698],
          ],
        },
        {
          fromName: '黑龙江',
          toName: '闵行',
          coords: [
            [126.661669, 45.742347],
            [121.381709, 31.112813],
          ],
        },
        {
          fromName: '天津',
          toName: '朝阳',
          coords: [
            [117.200983, 39.084158],
            [116.443108, 39.92147],
          ],
        },
        {
          fromName: '吉林',
          toName: '黄岛',
          coords: [
            [126.549572, 43.837883],
            [120.04619, 35.872664],
          ],
        },
        {
          fromName: '内蒙古',
          toName: '上海',
          coords: [
            [111.765618, 40.817498],
            [121.473701, 31.230416],
          ],
        },
        {
          fromName: '内蒙古',
          toName: '南京',
          coords: [
            [111.765618, 40.817498],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '辽宁',
          toName: '杭州',
          coords: [
            [123.42944, 41.835441],
            [120.15507, 30.274085],
          ],
        },
        {
          fromName: '黑龙江',
          toName: '海城',
          coords: [
            [126.661669, 45.742347],
            [122.685217, 40.882377],
          ],
        },
        {
          fromName: '吉林',
          toName: '西城',
          coords: [
            [126.549572, 43.837883],
            [116.365868, 39.912289],
          ],
        },
        {
          fromName: '四川',
          toName: '上海',
          coords: [
            [104.075931, 30.651652],
            [121.473701, 31.230416],
          ],
        },
        {
          fromName: '黑龙江',
          toName: '西城',
          coords: [
            [126.661669, 45.742347],
            [116.365868, 39.912289],
          ],
        },
        {
          fromName: '吉林',
          toName: '丹东',
          coords: [
            [126.549572, 43.837883],
            [124.354707, 40.0005],
          ],
        },
      ],
    },
  },
};
